noccy80/mspdev/reference/MSP430ware/deprecated/IAR/msp430fw423.h
/* T0_A3IV Definitions */
#define TA0IV_NONE          (0x0000u)    /* No Interrupt pending */
#define TA0IV_TACCR1        (0x0002u)    /* TA0CCR1_CCIFG */
#define TA0IV_TACCR2        (0x0004u)    /* TA0CCR2_CCIFG */
#define TA0IV_6             (0x0006u)    /* Reserved */
#define TA0IV_8             (0x0008u)    /* Reserved */
#define TA0IV_TAIFG         (0x000Au)    /* TA0IFG */

/************************************************************
* Timer1_A5
************************************************************/
#define __MSP430_HAS_T1A5__           /* Definition to show that Module is available */

#define TA1IV_              (0x011Eu)  /* Timer1_A5 Interrupt Vector Word */
READ_ONLY DEFW( TA1IV          , TA1IV_)
#define TA1CTL_             (0x0180u)  /* Timer1_A5 Control */
DEFW(   TA1CTL            , TA1CTL_)
#define TA1CCTL0_           (0x0182u)  /* Timer1_A5 Capture/Compare Control 0 */
DEFW(   TA1CCTL0          , TA1CCTL0_)
#define TA1CCTL1_           (0x0184u)  /* Timer1_A5 Capture/Compare Control 1 */
DEFW(   TA1CCTL1          , TA1CCTL1_)
#define TA1CCTL2_           (0x0186u)  /* Timer1_A5 Capture/Compare Control 2 */
DEFW(   TA1CCTL2          , TA1CCTL2_)
#define TA1CCTL3_           (0x0188u)  /* Timer1_A5 Capture/Compare Control 3 */
DEFW(   TA1CCTL3          , TA1CCTL3_)
#define TA1CCTL4_           (0x018Au)  /* Timer1_A5 Capture/Compare Control 4 */
DEFW(   TA1CCTL4          , TA1CCTL4_)
#define TA1R_               (0x0190u)  /* Timer1_A5 */
DEFW(   TA1R              , TA1R_)
#define TA1CCR0_            (0x0192u)  /* Timer1_A5 Capture/Compare 0 */
DEFW(   TA1CCR0           , TA1CCR0_)
#define TA1CCR1_            (0x0194u)  /* Timer1_A5 Capture/Compare 1 */
DEFW(   TA1CCR1           , TA1CCR1_)
#define TA1CCR2_            (0x0196u)  /* Timer1_A5 Capture/Compare 2 */
DEFW(   TA1CCR2           , TA1CCR2_)
#define TA1CCR3_            (0x0198u)  /* Timer1_A5 Capture/Compare 3 */
DEFW(   TA1CCR3           , TA1CCR3_)
#define TA1CCR4_            (0x019Au)  /* Timer1_A5 Capture/Compare 4 */
DEFW(   TA1CCR4           , TA1CCR4_)

/* Bits are already defined within the Timer0_Ax */

/* T1_A5IV Definitions */
#define TA1IV_NONE          (0x0000u)    /* No Interrupt pending */
#define TA1IV_TACCR1        (0x0002u)    /* TA1CCR1_CCIFG */
#define TA1IV_TACCR2        (0x0004u)    /* TA1CCR2_CCIFG */
#define TA1IV_TACCR3        (0x0006u)    /* TA1CCR3_CCIFG */
#define TA1IV_TACCR4        (0x0008u)    /* TA1CCR4_CCIFG */
#define TA1IV_TAIFG         (0x000Au)    /* TA1IFG */

/*************************************************************
* Flash Memory
*************************************************************/
#define __MSP430_HAS_FLASH__          /* Definition to show that Module is available */

#define FCTL1_              (0x0128u)  /* FLASH Control 1 */
DEFW(   FCTL1             , FCTL1_)
#define FCTL2_              (0x012Au)  /* FLASH Control 2 */
DEFW(   FCTL2             , FCTL2_)
#define FCTL3_              (0x012Cu)  /* FLASH Control 3 */
DEFW(   FCTL3             , FCTL3_)

#define FRKEY               (0x9600u)  /* Flash key returned by read */
#define FWKEY               (0xA500u)  /* Flash key for write */
#define FXKEY               (0x3300u)  /* for use with XOR instruction */

#define ERASE               (0x0002u)  /* Enable bit for Flash segment erase */
#define MERAS               (0x0004u)  /* Enable bit for Flash mass erase */
#define WRT                 (0x0040u)  /* Enable bit for Flash write */
#define BLKWRT              (0x0080u)  /* Enable bit for Flash segment write */
#define SEGWRT              (0x0080u)  /* old definition */ /* Enable bit for Flash segment write */

#define FN0                 (0x0001u)  /* Divide Flash clock by 1 to 64 using FN0 to FN5 according to: */
#define FN1                 (0x0002u)  /*  32*FN5 + 16*FN4 + 8*FN3 + 4*FN2 + 2*FN1 + FN0 + 1 */
#ifndef FN2
#define FN2                 (0x0004u)
#endif
#ifndef FN3
#define FN3                 (0x0008u)
#endif
#ifndef FN4
#define FN4                 (0x0010u)
#endif
#define FN5                 (0x0020u)
#define FSSEL0              (0x0040u)  /* Flash clock select 0 */        /* to distinguish from USART SSELx */
#define FSSEL1              (0x0080u)  /* Flash clock select 1 */

#define FSSEL_0             (0x0000u)  /* Flash clock select: 0 - ACLK */
#define FSSEL_1             (0x0040u)  /* Flash clock select: 1 - MCLK */
#define FSSEL_2             (0x0080u)  /* Flash clock select: 2 - SMCLK */
#define FSSEL_3             (0x00C0u)  /* Flash clock select: 3 - SMCLK */

#define BUSY                (0x0001u)  /* Flash busy: 1 */
#define KEYV                (0x0002u)  /* Flash Key violation flag */
#define ACCVIFG             (0x0004u)  /* Flash Access violation flag */
#define WAIT                (0x0008u)  /* Wait flag for segment write */
#define LOCK                (0x0010u)  /* Lock bit: 1 - Flash is locked (read only) */
#define EMEX                (0x0020u)  /* Flash Emergency Exit */

/************************************************************
* Comparator A
************************************************************/
#define __MSP430_HAS_COMPA__          /* Definition to show that Module is available */

#define CACTL1_             (0x0059u)  /* Comparator A Control 1 */
DEFC(   CACTL1            , CACTL1_)
#define CACTL2_             (0x005Au)  /* Comparator A Control 2 */
DEFC(   CACTL2            , CACTL2_)
#define CAPD_               (0x005Bu)  /* Comparator A Port Disable */
DEFC(   CAPD              , CAPD_)

#define CAIFG               (0x01)    /* Comp. A Interrupt Flag */
#define CAIE                (0x02)    /* Comp. A Interrupt Enable */
#define CAIES               (0x04)    /* Comp. A Int. Edge Select: 0:rising / 1:falling */
#define CAON                (0x08)    /* Comp. A enable */
#define CAREF0              (0x10)    /* Comp. A Internal Reference Select 0 */
#define CAREF1              (0x20)    /* Comp. A Internal Reference Select 1 */
#define CARSEL              (0x40)    /* Comp. A Internal Reference Enable */
#define CAEX                (0x80)    /* Comp. A Exchange Inputs */

#define CAREF_0             (0x00)    /* Comp. A Int. Ref. Select 0 : Off */
#define CAREF_1             (0x10)    /* Comp. A Int. Ref. Select 1 : 0.25*Vcc */
#define CAREF_2             (0x20)    /* Comp. A Int. Ref. Select 2 : 0.5*Vcc */
#define CAREF_3             (0x30)    /* Comp. A Int. Ref. Select 3 : Vt*/

#define CAOUT               (0x01)    /* Comp. A Output */
#define CAF                 (0x02)    /* Comp. A Enable Output Filter */
#define P2CA0               (0x04)    /* Comp. A Connect External Signal to CA0 : 1 */
#define P2CA1               (0x08)    /* Comp. A Connect External Signal to CA1 : 1 */
#define CACTL24             (0x10)
#define CACTL25             (0x20)
#define CACTL26             (0x40)
#define CACTL27             (0x80)

#define CAPD0               (0x01)    /* Comp. A Disable Input Buffer of Port Register .0 */
#define CAPD1               (0x02)    /* Comp. A Disable Input Buffer of Port Register .1 */
#define CAPD2               (0x04)    /* Comp. A Disable Input Buffer of Port Register .2 */
#define CAPD3               (0x08)    /* Comp. A Disable Input Buffer of Port Register .3 */
#define CAPD4               (0x10)    /* Comp. A Disable Input Buffer of Port Register .4 */
#define CAPD5               (0x20)    /* Comp. A Disable Input Buffer of Port Register .5 */
#define CAPD6               (0x40)    /* Comp. A Disable Input Buffer of Port Register .6 */
#define CAPD7               (0x80)    /* Comp. A Disable Input Buffer of Port Register .7 */

/************************************************************
* Scan-I/F
************************************************************/
#define __MSP430_HAS_SCANIF__         /* Definition to show that Module is available */

#define SIFDEBUG_           (0x01B0u)  /* SIF, Debug Register */
DEFW(   SIFDEBUG          , SIFDEBUG_)
#define SIFCNT_             (0x01B2u)  /* SIF, Counter1/2 */
DEFW(   SIFCNT            , SIFCNT_)
#define SIFPSMV_            (0x01B4u)  /* SIF, Processing State Machine */
DEFW(   SIFPSMV           , SIFPSMV_)
#define SIFCTL1_            (0x01B6u)  /* SIF, Control Register 1 */
DEFW(   SIFCTL1           , SIFCTL1_)
#define SIFCTL2_            (0x01B8u)  /* SIF, Control Register 2 */
DEFW(   SIFCTL2           , SIFCTL2_)
#define SIFCTL3_            (0x01BAu)  /* SIF, Control Register 3 */
DEFW(   SIFCTL3           , SIFCTL3_)
#define SIFCTL4_            (0x01BCu)  /* SIF, Control Register 4 */
DEFW(   SIFCTL4           , SIFCTL4_)
#define SIFCTL5_            (0x01BEu)  /* SIF, Control Register 5 */
DEFW(   SIFCTL5           , SIFCTL5_)
#define SIFDACR_            (0x01C0u)  /* SIF, Digital to Analog Conv. 0 */
#ifndef __IAR_SYSTEMS_ICC__
#define SIFDACR             (SIFDACR_) /* SIF, Digital to Analog Conv. Memory (for assembler) */
#else
#define SIFDACR             ((unsigned int*) SIFDACR_) /* SIF, Digital to Analog Conv. Memory (for C) */
#endif
#define SIFDACR0_           (0x01C0u)  /* SIF, Digital to Analog Conv. 0 */
DEFW(   SIFDACR0          , SIFDACR0_)
#define SIFDACR1_           (0x01C2u)  /* SIF, Digital to Analog Conv. 1 */
DEFW(   SIFDACR1          , SIFDACR1_)
#define SIFDACR2_           (0x01C4u)  /* SIF, Digital to Analog Conv. 2 */
DEFW(   SIFDACR2          , SIFDACR2_)
#define SIFDACR3_           (0x01C6u)  /* SIF, Digital to Analog Conv. 3 */
DEFW(   SIFDACR3          , SIFDACR3_)
#define SIFDACR4_           (0x01C8u)  /* SIF, Digital to Analog Conv. 4 */
DEFW(   SIFDACR4          , SIFDACR4_)
#define SIFDACR5_           (0x01CAu)  /* SIF, Digital to Analog Conv. 5 */
DEFW(   SIFDACR5          , SIFDACR5_)
#define SIFDACR6_           (0x01CCu)  /* SIF, Digital to Analog Conv. 6 */
DEFW(   SIFDACR6          , SIFDACR6_)
#define SIFDACR7_           (0x01CEu)  /* SIF, Digital to Analog Conv. 7 */
DEFW(   SIFDACR7          , SIFDACR7_)
#define SIFTSM_             (0x01D0u)  /* SIF, Timing State Machine 0 */
#ifndef __IAR_SYSTEMS_ICC__
#define SIFTSM              (SIFTSM_) /* SIF, Timing State Machine (for assembler) */
#else
#define SIFTSM              ((unsigned int*) SIFTSM_) /* SIF, Timing State Machine (for C) */
#endif
#define SIFTSM0_            (0x01D0u)  /* SIF, Timing State Machine 0 */
DEFW(   SIFTSM0           , SIFTSM0_)
#define SIFTSM1_            (0x01D2u)  /* SIF, Timing State Machine 1 */
DEFW(   SIFTSM1           , SIFTSM1_)
#define SIFTSM2_            (0x01D4u)  /* SIF, Timing State Machine 2 */
DEFW(   SIFTSM2           , SIFTSM2_)
#define SIFTSM3_            (0x01D6u)  /* SIF, Timing State Machine 3 */
DEFW(   SIFTSM3           , SIFTSM3_)
#define SIFTSM4_            (0x01D8u)  /* SIF, Timing State Machine 4 */
DEFW(   SIFTSM4           , SIFTSM4_)
#define SIFTSM5_            (0x01DAu)  /* SIF, Timing State Machine 5 */
DEFW(   SIFTSM5           , SIFTSM5_)
#define SIFTSM6_            (0x01DCu)  /* SIF, Timing State Machine 6 */
DEFW(   SIFTSM6           , SIFTSM6_)
#define SIFTSM7_            (0x01DEu)  /* SIF, Timing State Machine 7 */
DEFW(   SIFTSM7           , SIFTSM7_)
#define SIFTSM8_            (0x01E0u)  /* SIF, Timing State Machine 8 */
DEFW(   SIFTSM8           , SIFTSM8_)
#define SIFTSM9_            (0x01E2u)  /* SIF, Timing State Machine 9 */
DEFW(   SIFTSM9           , SIFTSM9_)
#define SIFTSM10_           (0x01E4u)  /* SIF, Timing State Machine 10 */
DEFW(   SIFTSM10          , SIFTSM10_)
#define SIFTSM11_           (0x01E6u)  /* SIF, Timing State Machine 11 */
DEFW(   SIFTSM11          , SIFTSM11_)
#define SIFTSM12_           (0x01E8u)  /* SIF, Timing State Machine 12 */
DEFW(   SIFTSM12          , SIFTSM12_)
#define SIFTSM13_           (0x01EAu)  /* SIF, Timing State Machine 13 */
DEFW(   SIFTSM13          , SIFTSM13_)
#define SIFTSM14_           (0x01ECu)  /* SIF, Timing State Machine 14 */
DEFW(   SIFTSM14          , SIFTSM14_)
#define SIFTSM15_           (0x01EEu)  /* SIF, Timing State Machine 15 */
DEFW(   SIFTSM15          , SIFTSM15_)
#define SIFTSM16_           (0x01F0u)  /* SIF, Timing State Machine 16 */
DEFW(   SIFTSM16          , SIFTSM16_)
#define SIFTSM17_           (0x01F2u)  /* SIF, Timing State Machine 17 */
DEFW(   SIFTSM17          , SIFTSM17_)
#define SIFTSM18_           (0x01F4u)  /* SIF, Timing State Machine 18 */
DEFW(   SIFTSM18          , SIFTSM18_)
#define SIFTSM19_           (0x01F6u)  /* SIF, Timing State Machine 19 */
DEFW(   SIFTSM19          , SIFTSM19_)
#define SIFTSM20_           (0x01F8u)  /* SIF, Timing State Machine 20 */
DEFW(   SIFTSM20          , SIFTSM20_)
#define SIFTSM21_           (0x01FAu)  /* SIF, Timing State Machine 21 */
DEFW(   SIFTSM21          , SIFTSM21_)
#define SIFTSM22_           (0x01FCu)  /* SIF, Timing State Machine 22 */
DEFW(   SIFTSM22          , SIFTSM22_)
#define SIFTSM23_           (0x01FEu)  /* SIF, Timing State Machine 23 */
DEFW(   SIFTSM23          , SIFTSM23_)

/* SIFCTL1 */
#define SIFEN               (0x0001u)    /* SIF Enable */
#define SIFTESTD            (0x0002u)    /* SIF 0:Normal / 1:Test Mode */
#define SIFIFG0             (0x0004u)    /* SIF Interrupt Flag 0 */
#define SIFIFG1             (0x0008u)    /* SIF Interrupt Flag 1 */
#define SIFIFG2             (0x0010u)    /* SIF Interrupt Flag 2 */
#define SIFIFG3             (0x0020u)    /* SIF Interrupt Flag 3 */
#define SIFIFG4             (0x0040u)    /* SIF Interrupt Flag 4 */
#define SIFIFG5             (0x0080u)    /* SIF Interrupt Flag 5 */
#define SIFIFG6             (0x0100u)    /* SIF Interrupt Flag 6 */
#define SIFIE0              (0x0200u)    /* SIF Interrupt Enable 0 */
#define SIFIE1              (0x0400u)    /* SIF Interrupt Enable 1 */
#define SIFIE2              (0x0800u)    /* SIF Interrupt Enable 2 */
#define SIFIE3              (0x1000u)    /* SIF Interrupt Enable 3 */
#define SIFIE4              (0x2000u)    /* SIF Interrupt Enable 4 */
#define SIFIE5              (0x4000u)    /* SIF Interrupt Enable 5 */
#define SIFIE6              (0x8000u)    /* SIF Interrupt Enable 6 */

/* SIFCTL2 */
#define SIFTCH0OUT          (0x0001u)    /* SIF TCH0 result */
#define SIFTCH1OUT          (0x0002u)    /* SIF TCH1 result */
#define SIFTCH00            (0x0004u)    /* SIF 1. Channel select 0 */
#define SIFTCH01            (0x0008u)    /* SIF 1. Channel select 1 */
#define SIFTCH10            (0x0010u)    /* SIF 2. Channel select 0 */
#define SIFTCH11            (0x0020u)    /* SIF 2. Channel select 1 */
#define SIFTEN              (0x0040u)    /* SIF Enable Transistors */
#define SIFSH               (0x0080u)    /* SIF Sample on/off */
#define SIFVCC2             (0x0100u)    /* SIF VCC/2 Generator off/on */
#define SIFVSS              (0x0200u)    /* SIF Select Terminal for sample Cap. */
#define SIFCACI3            (0x0400u)    /* SIF Selection of SIFCI3 */
#define SIFCISEL            (0x0800u)    /* SIF Comparator Input Select */
#define SIFCAX              (0x1000u)    /* SIF Select CA Source */
#define SIFCAINV            (0x2000u)    /* SIF Invert CA Output 0:off/1:on */
#define SIFCAON             (0x4000u)    /* SIF Switch CA on */
#define SIFDACON            (0x8000u)    /* SIF Switch DAC on */

/* SIFCTL3 */
#define SIF0OUT             (0x0001u)    /* SIF Sensor 0 Out */
#define SIF1OUT             (0x0002u)    /* SIF Sensor 1 Out */
#define SIF2OUT             (0x0004u)    /* SIF Sensor 2 Out */
#define SIF3OUT             (0x0008u)    /* SIF Sensor 3 Out */
#define SIFIFGSET0          (0x0010u)    /* SIF SIFIFG0 level select */
#define SIFIFGSET1          (0x0020u)    /* SIF SIFIFG1 level select */
#define SIFIFGSET2          (0x0040u)    /* SIF SIFIFG2 level select */
#define SIFCS               (0x0080u)    /* SIF Capture Select */
#define SIFIS10             (0x0100u)    /* SIF SIFIFG3 Int.Flag Source 0 */
#define SIFIS11             (0x0200u)    /* SIF SIFIFG3 Int.Flag Source 1 */
#define SIFIS20             (0x0400u)    /* SIF SIFIFG4 Int.Flag Source 0 */
#define SIFIS21             (0x0800u)    /* SIF SIFIFG4 Int.Flag Source 1 */
#define SIFS10              (0x1000u)    /* SIF S1 Source Select 0 */
#define SIFS11              (0x2000u)    /* SIF S1 Source Select 1 */
#define SIFS20              (0x4000u)    /* SIF S2 Source Select 0 */
#define SIFS21              (0x8000u)    /* SIF S2 Source Select 1 */

