noccy80/mspdev/reference/MSP430ware/deprecated/IAR/msp430fw423.h
#define SIFIS1_0            (0x0000u)    /* SIF SIFIFG3 set with each count of SIFCNT1 */
#define SIFIS1_1            (0x0100u)    /* SIF SIFIFG3 set if (SIFCNT1 mod  4)=0 */
#define SIFIS1_2            (0x0200u)    /* SIF SIFIFG3 set if (SIFCNT1 mod 64)=0 */
#define SIFIS1_3            (0x0300u)    /* SIF SIFIFG3 set if SIFCNT1 rolls over */
#define SIFIS2_0            (0x0000u)    /* SIF SIFIFG4 set with each count of SIFCNT2 */
#define SIFIS2_1            (0x0400u)    /* SIF SIFIFG4 set if (SIFCNT2 mod  4)=0 */
#define SIFIS2_2            (0x0800u)    /* SIF SIFIFG4 set if (SIFCNT2 mod 64)=0 */
#define SIFIS2_3            (0x0C00u)    /* SIF SIFIFG4 set if SIFCNT2 rolls over */
#define SIFS1_0             (0x0000u)    /* SIF S1 Source : SIF0OUT */
#define SIFS1_1             (0x1000u)    /* SIF S1 Source : SIF1OUT */
#define SIFS1_2             (0x2000u)    /* SIF S1 Source : SIF2OUT */
#define SIFS1_3             (0x3000u)    /* SIF S1 Source : SIF3OUT */
#define SIFS2_0             (0x0000u)    /* SIF S2 Source : SIF0OUT */
#define SIFS2_1             (0x4000u)    /* SIF S2 Source : SIF1OUT */
#define SIFS2_2             (0x8000u)    /* SIF S2 Source : SIF2OUT */
#define SIFS2_3             (0xC000u)    /* SIF S2 Source : SIF3OUT */

/* SIFCTL4 */
#define SIFDIV10            (0x0001u)    /* SIF Clock Divider 1.0 */
#define SIFDIV11            (0x0002u)    /* SIF Clock Divider 1.1 */
#define SIFDIV20            (0x0004u)    /* SIF Clock Divider 2.0 */
#define SIFDIV21            (0x0008u)    /* SIF Clock Divider 2.1 */
#define SIFDIV3A0           (0x0010u)    /* SIF Clock Divider 3.0 */
#define SIFDIV3A1           (0x0020u)    /* SIF Clock Divider 3.1 */
#define SIFDIV3A2           (0x0040u)    /* SIF Clock Divider 3.2 */
#define SIFDIV3B0           (0x0080u)    /* SIF Clock Divider 3.3 */
#define SIFDIV3B1           (0x0100u)    /* SIF Clock Divider 3.4 */
#define SIFDIV3B2           (0x0200u)    /* SIF Clock Divider 3.5 */
#define SIFQ6EN             (0x0400u)    /* SIF Feedback 6 Enable */
#define SIFQ7EN             (0x0800u)    /* SIF Feedback 7 Enable */
#define SIFCNT1ENP          (0x1000u)    /* SIF Enable SIFCNT1 up count */
#define SIFCNT1ENM          (0x2000u)    /* SIF Enable SIFCNT1 down count */
#define SIFCNT2EN           (0x4000u)    /* SIF Enable SIFCNT2 count */
#define SIFCNTRST           (0x8000u)    /* SIF Enable Counter Reset on Read */

#define SIFDIV1_1           (0x0000u)    /* SIF Clock Divider 1: /1 */
#define SIFDIV1_2           (0x0001u)    /* SIF Clock Divider 1: /2 */
#define SIFDIV1_4           (0x0002u)    /* SIF Clock Divider 1: /4 */
#define SIFDIV1_8           (0x0003u)    /* SIF Clock Divider 1: /8 */
#define SIFDIV2_1           (0x0000u)    /* SIF Clock Divider 2: /1 */
#define SIFDIV2_2           (0x0004u)    /* SIF Clock Divider 2: /2 */
#define SIFDIV2_4           (0x0008u)    /* SIF Clock Divider 2: /4 */
#define SIFDIV2_8           (0x000Cu)    /* SIF Clock Divider 2: /8 */

#define SIFDIV3_2           (0x0000u)    /* SIF Clock Divider 3: /2 */
#define SIFDIV3_6           (0x0010u)    /* SIF Clock Divider 3: /6 */
#define SIFDIV3_10          (0x0020u)    /* SIF Clock Divider 3: /10 */
#define SIFDIV3_14          (0x0030u)    /* SIF Clock Divider 3: /14 */
#define SIFDIV3_18          (0x0040u)    /* SIF Clock Divider 3: /18 */
#define SIFDIV3_22          (0x0050u)    /* SIF Clock Divider 3: /22 */
#define SIFDIV3_26          (0x0060u)    /* SIF Clock Divider 3: /26 */
#define SIFDIV3_30          (0x0070u)    /* SIF Clock Divider 3: /30 */
#define SIFDIV3_42          (0x00B0u)    /* SIF Clock Divider 3: /42 */
#define SIFDIV3_50          (0x0120u)    /* SIF Clock Divider 3: /50 */
#define SIFDIV3_54          (0x00C0u)    /* SIF Clock Divider 3: /54 */
#define SIFDIV3_66          (0x00D0u)    /* SIF Clock Divider 3: /66 */
#define SIFDIV3_70          (0x0130u)    /* SIF Clock Divider 3: /70 */
#define SIFDIV3_78          (0x00E0u)    /* SIF Clock Divider 3: /78 */
#define SIFDIV3_90          (0x00F0u)    /* SIF Clock Divider 3: /90 */
#define SIFDIV3_98          (0x01B0u)    /* SIF Clock Divider 3: /98 */
#define SIFDIV3_110         (0x0150u)    /* SIF Clock Divider 3: /110 */
#define SIFDIV3_126         (0x01C0u)    /* SIF Clock Divider 3: /126 */
#define SIFDIV3_130         (0x0160u)    /* SIF Clock Divider 3: /130 */
#define SIFDIV3_150         (0x0170u)    /* SIF Clock Divider 3: /150 */
#define SIFDIV3_154         (0x01D0u)    /* SIF Clock Divider 3: /154 */
#define SIFDIV3_162         (0x0240u)    /* SIF Clock Divider 3: /162 */
#define SIFDIV3_182         (0x01E0u)    /* SIF Clock Divider 3: /182 */
#define SIFDIV3_198         (0x0250u)    /* SIF Clock Divider 3: /198 */
#define SIFDIV3_210         (0x01F0u)    /* SIF Clock Divider 3: /210 */
#define SIFDIV3_234         (0x0260u)    /* SIF Clock Divider 3: /234 */
#define SIFDIV3_242         (0x02D0u)    /* SIF Clock Divider 3: /242 */
#define SIFDIV3_270         (0x0270u)    /* SIF Clock Divider 3: /270 */
#define SIFDIV3_286         (0x02E0u)    /* SIF Clock Divider 3: /286 */
#define SIFDIV3_330         (0x02F0u)    /* SIF Clock Divider 3: /330 */
#define SIFDIV3_338         (0x0360u)    /* SIF Clock Divider 3: /338 */
#define SIFDIV3_390         (0x0370u)    /* SIF Clock Divider 3: /390 */
#define SIFDIV3_450         (0x03F0u)    /* SIF Clock Divider 3: /450 */

/* SIFCTL5 */
#define SIFCLKEN            (0x0001u)    /* SIF 0:SMCLK for SIFCLK / 1:SIFCLKG for SIFCLK */
#define SIFCLKGON           (0x0002u)    /* SIF Switch SIFCLKG on */
#define SIFFNOM             (0x0004u)    /* SIF Select Nominal Frequ. 0:4MHz / 1:1MHz */
#define SIFCLKFQ0           (0x0008u)    /* SIF Clock Generator frequency adjust 0 */
#define SIFCLKFQ1           (0x0010u)    /* SIF Clock Generator frequency adjust 1 */
#define SIFCLKFQ2           (0x0020u)    /* SIF Clock Generator frequency adjust 2 */
#define SIFCLKFQ3           (0x0040u)    /* SIF Clock Generator frequency adjust 3 */
#define SIFTSMRP            (0x0080u)    /* SIF Timing State Machine Repeat mode */
#define SIFCNT30            (0x0100u)    /* SIF Counter 3.0 */
#define SIFCNT31            (0x0200u)    /* SIF Counter 3.1 */
#define SIFCNT32            (0x0400u)    /* SIF Counter 3.2 */
#define SIFCNT33            (0x0800u)    /* SIF Counter 3.3 */
#define SIFCNT34            (0x1000u)    /* SIF Counter 3.4 */
#define SIFCNT35            (0x2000u)    /* SIF Counter 3.5 */
#define SIFCNT36            (0x4000u)    /* SIF Counter 3.6 */
#define SIFCNT37            (0x8000u)    /* SIF Counter 3.7 */

