noccy80/mspdev/reference/MSP430ware/deprecated/IAR/msp430fw423.h
/* SIFTSM */
#define SIFCH0              (0x0001u)    /* SIF Select channel for tsm: 0 */
#define SIFCH1              (0x0002u)    /* SIF Select channel for tsm: 1 */
#define SIFLCEN             (0x0004u)    /* SIF LC enable */
#define SIFEX               (0x0008u)    /* SIF  */
#define SIFCA               (0x0010u)    /* SIF  */
#define SIFCLKON            (0x0020u)    /* SIF  */
#define SIFRSON             (0x0040u)    /* SIF  */
#define SIFTESTS1           (0x0080u)    /* SIF  */
#define SIFDAC              (0x0100u)    /* SIF  */
#define SIFSTOP             (0x0200u)    /* SIF  */
#define SIFACLK             (0x0400u)    /* SIF  */
#define SIFREPEAT0          (0x0800u)    /* SIF  */
#define SIFREPEAT1          (0x1000u)    /* SIF  */
#define SIFREPEAT2          (0x2000u)    /* SIF  */
#define SIFREPEAT3          (0x4000u)    /* SIF  */
#define SIFREPEAT4          (0x8000u)    /* SIF  */

/************************************************************
* Interrupt Vectors (offset from 0xFFE0)
************************************************************/

#define BASICTIMER_VECTOR   (0 * 2u)  /* 0xFFE0 Basic Timer */
#define PORT2_VECTOR        (1 * 2u)  /* 0xFFE2 Port 2 */
#define PORT1_VECTOR        (4 * 2u)  /* 0xFFE8 Port 1 */
#define TIMER0_A1_VECTOR    (5 * 2u)  /* 0xFFEA Timer0_A CC1-2, TA0 */
#define TIMER0_A0_VECTOR    (6 * 2u)  /* 0xFFEC Timer0_A CC0 */
#define SCANIF_VECTOR       (9 * 2u)  /* 0xFFF2 Scan Inteface */
#define WDT_VECTOR          (10 * 2u) /* 0xFFF4 Watchdog Timer */
#define COMPARATORA_VECTOR  (11 * 2u) /* 0xFFF6 Comparator A */
#define TIMER1_A1_VECTOR    (12 * 2u) /* 0xFFF8 Timer1_A CC1-4, TA1 */
#define TIMER1_A0_VECTOR    (13 * 2u) /* 0xFFFA Timer1_A CC0 */
#define NMI_VECTOR          (14 * 2u) /* 0xFFFC Non-maskable */
#define RESET_VECTOR        (15 * 2u) /* 0xFFFE Reset [Highest Priority] */

/* Alternate Names */
#define TIMERA1_VECTOR      TIMER0_A1_VECTOR
#define TIMERA0_VECTOR      TIMER0_A0_VECTOR

/************************************************************
* End of Modules
************************************************************/
#pragma language=default

#endif /* #ifndef __msp430xW42x */

